<a href="https://colab.research.google.com/github/nawaalharris/ISM-4402-Business-Intelligence/blob/master/Chapter_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
grades = [76, -2, 77, 78, 101]

In [6]:
GradeList = zip(names,grades)
df = pd.DataFrame(data=GradeList, 
     columns= ['Names', 'Grades'] )
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [7]:
df.loc[(df['Grades'] <= 0, 'Grades')] = 0

In [8]:
df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     101